create_clock -period 16.667 -name prog_clko -waveform {0.000 8.333} [get_ports -prop_thru_buffers prog_clko]
set_input_delay -clock [get_clocks prog_clko] -min -add_delay 1.000 [get_ports -prop_thru_buffers {prog_d[*]}]
set_input_delay -clock [get_clocks prog_clko] -max -add_delay 5.517 [get_ports -prop_thru_buffers {prog_d[*]}]
set_input_delay -clock [get_clocks prog_clko] -min -add_delay 1.000 [get_ports -prop_thru_buffers prog_rxen]
set_input_delay -clock [get_clocks prog_clko] -max -add_delay 5.517 [get_ports -prop_thru_buffers prog_rxen]
set_input_delay -clock [get_clocks prog_clko] -min -add_delay 1.000 [get_ports -prop_thru_buffers prog_txen]
set_input_delay -clock [get_clocks prog_clko] -max -add_delay 5.517 [get_ports -prop_thru_buffers prog_txen]
set_output_delay -clock [get_clocks prog_clko] -min -add_delay 0.000 [get_ports -prop_thru_buffers {prog_d[*]}]
set_output_delay -clock [get_clocks prog_clko] -max -add_delay 6.000 [get_ports -prop_thru_buffers {prog_d[*]}]
set_output_delay -clock [get_clocks prog_clko] -min -add_delay 0.000 [get_ports -prop_thru_buffers prog_oen]
set_output_delay -clock [get_clocks prog_clko] -max -add_delay 6.000 [get_ports -prop_thru_buffers prog_oen]
set_output_delay -clock [get_clocks prog_clko] -min -add_delay 0.000 [get_ports -prop_thru_buffers prog_rdn]
set_output_delay -clock [get_clocks prog_clko] -max -add_delay 6.000 [get_ports -prop_thru_buffers prog_rdn]
set_output_delay -clock [get_clocks prog_clko] -min -add_delay 0.000 [get_ports -prop_thru_buffers prog_wrn]
set_output_delay -clock [get_clocks prog_clko] -max -add_delay 6.000 [get_ports -prop_thru_buffers prog_wrn]

set_false_path -through [get_pins -filter {NAME =~ *SyncAsync*/oSyncStages_reg[*]/D} -hier]
set_false_path -through [get_pins -filter {NAME =~ *SyncAsync*/oSyncStages*/PRE || NAME =~ *SyncAsync*/oSyncStages*/CLR} -hier]

set_false_path -through [get_pins -filter {NAME =~ *in_*_sync/*/CLR} -hier]
set_false_path -from [get_cells -hier -filter {NAME =~ *in_*_sync/iData_int_reg[*]}] -to [get_cells -hier -filter {NAME=~ *in_*_sync/oData_reg[*]}]